ams/src/Documents/_ПриемИзПереработки/_ПриемИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ПриемИзПереработки</name>
  <registerRecords>AccumulationRegister._ТоварыПереданные</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеТоваров</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.ВариантыКомплектацииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СборкаТоваров</name>
      <type>
        <types>DocumentRef.СборкаТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/InformationRegisters/AMS_ТоварыИзПереработки/AMS_ТоварыИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AMS_ТоварыИзПереработки</name>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Documents/_ПриемИзПереработки/Forms/ФормаПодбор/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	СоздатьУсловноеОформление();

	Данные = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);

	ЗаполнитьТаблицуПодбора(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Данные были изменены. Перенести изменения в документ?'"), РежимДиалогаВопрос.ДаНет);

	Иначе
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");

	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокументВыполнить()
	ПеренестиТоварыВДокумент();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьУсловноеОформление()
	ЦветФона = ЦветаСтиля.ЦветФонаКнопки;

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТоварыСпецификация");

	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.ЕстьВыбор");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПодбора(Данные)
	УстановитьПривилегированныйРежим(Истина);
	
	//@skip-check bsl-legacy-check-string-literal
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Контрагент, "Наименование") = "Эстервуд"
		И Данные.Товары.Количество() = 0 Тогда

		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("01-0002672");

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", Номенклатура);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Ссылка КАК Спецификация
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры КАК т
		|ГДЕ
		|	т.Владелец = &Владелец
		|	И Не т.ПометкаУдаления
		|	И т.Основной";
		Рез = Запрос.Выполнить();
		Выб = Рез.Выбрать();
		Выб.Следующий();
		Спецификация = Выб.Спецификация;
		Стр = Товары.Добавить();
		Стр.Номенклатура = Номенклатура;
		Стр.Спецификация = Спецификация;
		Стр.Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "_Упаковка");

	Иначе
		Склад = Данные.Склад;
		Если Склад = AMS_ВызовСервера.Цех1() Тогда
			Сегмент = AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха1();
			
		ИначеЕсли Склад = AMS_ВызовСервера.Цех2() Тогда
			Сегмент = AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха2();
			
		ИначеЕсли Склад = AMS_ВызовСервера.Цех3() Тогда
			Сегмент = AMS_ВызовСервера.СегментыНоменклатурыУпаковкаЦеха3();
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", Данные.Дата);
		Запрос.УстановитьПараметр("Товары", Данные.Товары);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Сегмент", Сегмент);
		Запрос.УстановитьПараметр("Контрагент", Данные.Контрагент);

		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	т.Номенклатура КАК Номенклатура,
		|	т.Спецификация КАК Спецификация,
		|	т.Упаковка КАК Упаковка,
		|	т.КоличествоУпаковок КАК КоличествоУпаковок,
		|	т.Количество КАК Количество,
		|	т.СборкаТоваров КАК СборкаТоваров
		|ПОМЕСТИТЬ товары
		|ИЗ
		|	&Товары КАК т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	таб.Номенклатура КАК Номенклатура,
		|	спец.Ссылка КАК Спецификация
		|ПОМЕСТИТЬ флаконы
		|ИЗ
		|	РегистрСведений.AMS_ТоварыИзПереработки КАК таб
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК спец
		|		ПО таб.Номенклатура = спец.Владелец
		|ГДЕ
		|	таб.Контрагент = &Контрагент
		|	И таб.Номенклатура В
		|			(ВЫБРАТЬ
		|				таб.Номенклатура
		|			ИЗ
		|				РегистрСведений.НоменклатураСегмента КАК таб
		|			ГДЕ
		|				таб.Сегмент = &Сегмент)
		|	И спец.Основной
		|	И НЕ спец.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	таб.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ спец.Ссылка) КАК КоличествоСпецификаций
		|ПОМЕСТИТЬ спец
		|ИЗ
		|	РегистрСведений.AMS_ТоварыИзПереработки КАК таб
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК спец
		|		ПО таб.Номенклатура = спец.Владелец
		|ГДЕ
		|	таб.Контрагент = &Контрагент
		|	И таб.Номенклатура В
		|			(ВЫБРАТЬ
		|				таб.Номенклатура
		|			ИЗ
		|				РегистрСведений.НоменклатураСегмента КАК таб
		|			ГДЕ
		|				таб.Сегмент = &Сегмент)
		|	И НЕ спец.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	таб.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА флаконы.Номенклатура ЕСТЬ NULL
		|			ТОГДА товары.Номенклатура
		|		ИНАЧЕ флаконы.Номенклатура
		|	КОНЕЦ КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА товары.Спецификация ЕСТЬ NULL
		|			ТОГДА флаконы.Спецификация
		|		ИНАЧЕ товары.Спецификация
		|	КОНЕЦ КАК Спецификация,
		|	товары.Упаковка КАК Упаковка,
		|	ЕСТЬNULL(товары.КоличествоУпаковок, 0) КАК КоличествоУпаковок,
		|	ЕСТЬNULL(товары.Количество, 0) КАК Количество,
		|	товары.СборкаТоваров КАК СборкаТоваров
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	товары КАК товары
		|		ПОЛНОЕ СОЕДИНЕНИЕ флаконы КАК флаконы
		|		ПО товары.Номенклатура = флаконы.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Номенклатура КАК Номенклатура,
		|	вт.Спецификация КАК Спецификация,
		|	вт.Упаковка КАК Упаковка,
		|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
		|	вт.Количество КАК Количество,
		|	вт.СборкаТоваров КАК СборкаТоваров,
		|	ВЫБОР
		|		КОГДА спец.КоличествоСпецификаций > 1
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьВыбор
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ спец КАК спец
		|		ПО вт.Номенклатура = спец.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт.Номенклатура.Наименование";

		Результат = Запрос.Выполнить();
		Товары.Загрузить(Результат.Выгрузить());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТоварыВДокумент()
	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Закрыть(ПолучитьМассивДанных());
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДанных()
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Номенклатура");
	Табл.Колонки.Добавить("Спецификация");
	Табл.Колонки.Добавить("Упаковка");
	Табл.Колонки.Добавить("КоличествоУпаковок");
	Табл.Колонки.Добавить("Количество");
	Табл.Колонки.Добавить("СборкаТоваров");

	Для Каждого Стр Из Товары Цикл
		Если Стр.Количество = 0 Тогда
			Если ЗначениеЗаполнено(Стр.СборкаТоваров) Тогда
				мср.УстановитьПометкуУдаленияДокументу(Стр.СборкаТоваров, Истина);
				Стр.СборкаТоваров = Документы.СборкаТоваров.ПустаяСсылка();
			КонецЕсли;

		Иначе
			НовСтр = Табл.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЕсли;
	КонецЦикла;

	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Табл);
КонецФункции

#КонецОбласти
